#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Fri Apr 14 15:15:18 2023

set_arch -family Logos -device PGL22G -speedgrade -6 -package FBG256
compile -top_module m1_soc_top
add_design C:/Users/86152/Desktop/rtl_design/pnr/ipcore/DDR3_50H/DDR3_50H.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
remove_design -force C:/Users/YHX/Desktop/rtl_design/pnr/ipcore/DDR3/DDR3.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module axi1_wr_test
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/cmos_8_16bit.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/fram_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/hdmi_ddr_ov5640_top_20230413215821.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/i2c_com.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/iic_dri.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/ms7200_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/ms7210_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/ms7210_ctl_20230413215822.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/ms72xx_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/ov5640_ddr.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/power_on_delay.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/rd_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/rd_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/reg_config.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/sync_vg.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/wr_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/wr_cmd_trans.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/wr_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/wr_rd_ctrl_top.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/wr_rd_ctrl_top_20230413215822.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module axi1_wr_test
remove_design -verilog "C:/Users/86152/Desktop/rtl_design/src/axi1_wr_test.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
add_design "C:/Users/86152/Desktop/rtl_design/pnr/source/wr_fram_buf/wr_fram_buf.idf"
add_design "C:/Users/86152/Desktop/rtl_design/pnr/source/rd_fram_buf/rd_fram_buf.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
remove_design -verilog "C:/Users/86152/Desktop/rtl_design/src/ov5640_ddr/hdmi_ddr_ov5640_top_20230413215821.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/cmos_8_16bit.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/fram_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/hdmi_ddr_ov5640_top.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/hdmi_ddr_ov5640_top_20230413215821.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/i2c_com.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/iic_dri.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/ms7200_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/ms7210_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/ms7210_ctl_20230413215822.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/ms72xx_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/power_on_delay.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/rd_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/rd_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/reg_config.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/sync_vg.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/wr_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/wr_cmd_trans.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/wr_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/wr_rd_ctrl_top.v"
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/wr_rd_ctrl_top_20230413215822.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
add_design "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/hdmi_ddr.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/hdmi_ddr_ov5640_top_20230413215821.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/hdmi_ddr_ov5640_top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
remove_design -verilog "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/ms7210_ctl_20230413215822.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design/src/hdmi_ddr/wr_rd_ctrl_top_20230413215822.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/ms7200_ctl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/ms7210_ctl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/ms7210_ctl_20230413215822.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/fram_buf.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/ms72xx_ctl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/rd_buf.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/rd_ctrl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/sync_vg.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/wr_buf.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/wr_cmd_trans.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/wr_ctrl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/wr_rd_ctrl_top.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/wr_rd_ctrl_top_20230413215822.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/cmos_8_16bit.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/wr_rd_ctrl_top.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/wr_ctrl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/wr_cmd_trans.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/sync_vg.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/reg_config.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/rd_ctrl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/wr_buf.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/fram_buf.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/power_on_delay.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/rd_buf.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/i2c_com.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/iic_dri.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/ov5640_ddr.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/hdmi_ddr.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/ms7200_ctl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/ms7210_ctl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/iic_dri.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/iic_dri.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/ms72xx_ctl.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/power_on_delay.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/reg_config.v"
remove_design C:/Users/86152/Desktop/rtl_design720/pnr/ipcore/TEST_RAM/TEST_RAM.idf
add_design "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/ov5640_ddr.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/i2c_com.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/iic_dri.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/power_on_delay.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/reg_config.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/hdmi_ddr.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/iic_dri.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/ms72xx_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/ms7200_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/ms7210_ctl.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/ddr_hdmi.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/fram_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/rd_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/rd_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/sync_vg.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/wr_buf.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/wr_cmd_trans.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/wr_ctrl.v"
add_design "C:/Users/86152/Desktop/rtl_design720/src/ddr_hdmi/wr_rd_ctrl_top.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/ov5640_ddr/iic_dri.v"
remove_design -verilog "C:/Users/86152/Desktop/rtl_design720/src/hdmi_ddr/i2c_com.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
add_design "C:/Users/86152/Desktop/rtl_design_v1.0/rtl_design_v1.0/src/hsst_ddr.v"
add_design "C:/Users/86152/Desktop/rtl_design_v1.0/rtl_design_v1.0/pnr/source/u_hsst/u_hsst.idf"
add_design "C:/Users/86152/Desktop/rtl_design_v1.0/rtl_design_v1.0/pnr/source/hsst_fifo/hsst_fifo.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
gen_bit_stream 
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module m1_soc_top
synthesize -ads -fanout_guide 1000 -min_controlset_size 4 -selected_syn_tool_opt 2 
dev_map -detail -devmap_remove_dups 1 
pnr -parallel 5 -mode {performance} -optimize_multi_corner_timing -fix_hold_violation -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery -optimize_routing_recovery 
report_timing 
gen_bit_stream 
